app/controllers/products_controller.rb

INSERT INTO "products" ("title", "description", "file", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["title", "test 2"], ["description", "sdgvas"], ["file", "reankour.png"], ["created_at", "2019-02-18 15:16:33.483425"], ["updated_at", "2019-02-18 15:16:33.483425"], ["user_id", 12]]
---
  def create
  	@product = current_user.products.new(product_params)
  	if @product.save